In [1]:
import numpy as np
import pandas as pd

In [3]:
dict1 = {
    "name":['albin','benny','john'],
    "age":[18,19,45],
    "city":['kannur','kerala','india']

}

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

    name  age    city
0  albin   18  kannur
1  benny   19  kerala
2   john   45   india

In [6]:
df.to_csv('friends.csv')

In [7]:
df.tail(2)

    name  age    city
1  benny   19  kerala
2   john   45   india

In [8]:
df.head(2)

    name  age    city
0  albin   18  kannur
1  benny   19  kerala

In [9]:
bank = pd.read_csv(r"C:\Users\Anasiya\Desktop\Pandas\bank_data.csv")

In [10]:
bank

,id,expected_recovery_amount,actual_recovery_amount,recovery_strategy,age,sex
0,2030,194,263.540000,Level 0 Recovery,19,Male
1,1150,486,416.090000,Level 0 Recovery,25,Female
2,380,527,429.350000,Level 0 Recovery,27,Male
3,1838,536,296.990000,Level 0 Recovery,25,Male
4,1995,541,346.385000,Level 0 Recovery,34,Male
...,...,...,...,...,...,...
1877,361,9785,15388.195990,Level 4 Recovery,65,Female
1878,196,9857,9709.909257,Level 4 Recovery,68,Female
1879,313,9859,30209.181790,Level 4 Recovery,58,Female
1880,1781,9920,20386.232190,Level 4 Recovery,67,Female
1881,522,9964,16706.305920,Level 4 Recovery,53,Male

In [12]:
bank['id']

0       2030
1       1150
2        380
3       1838
4       1995
        ...
1877     361
1878     196
1879     313
1880    1781
1881     522
Name: id, Length: 1882, dtype: int64

In [13]:
bank['id'][0]

2030

In [14]:
bank['id'][0]=456

C:\Users\Anasiya\AppData\Local\Temp\ipykernel_18684\1694027515.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bank['id'][0]=456

In [15]:
bank

,id,expected_recovery_amount,actual_recovery_amount,recovery_strategy,age,sex
0,456,194,263.540000,Level 0 Recovery,19,Male
1,1150,486,416.090000,Level 0 Recovery,25,Female
2,380,527,429.350000,Level 0 Recovery,27,Male
3,1838,536,296.990000,Level 0 Recovery,25,Male
4,1995,541,346.385000,Level 0 Recovery,34,Male
...,...,...,...,...,...,...
1877,361,9785,15388.195990,Level 4 Recovery,65,Female
1878,196,9857,9709.909257,Level 4 Recovery,68,Female
1879,313,9859,30209.181790,Level 4 Recovery,58,Female
1880,1781,9920,20386.232190,Level 4 Recovery,67,Female
1881,522,9964,16706.305920,Level 4 Recovery,53,Male

In [16]:
bank.to_csv('bank.csv ')